{
  "reviews": [
    { "movie-id": 1, "review": "Loved this movie! Cerebral, engaging science fiction at its best. Do yourself a favor and don't watch any trailers or read anything about it before seeing it. You won't be disappointed!" },
    { "movie-id": 2, "review": "Another fantastic science fiction, shot on an insanely low budget. Fun fact: there was actually no script for this movie. The director gave each actor/actress note cards the day-of filming with character motivations and suspicions, and the actors improvised the actual dialogue and acting. So, so, SO GOOD!" },
    { "movie-id": 3, "review": "I know this movie got a lot of flak when it came out, with many disliking it passionately. I first saw it in IMAX and I was really emotionally moved by it's poignancy. I think the film posits the idea that the universe is so incomprehensibly huge that the only way to make sense of our place in it is with the human relationships we have with each other. The whole \"love will guide me\" trope is cliché, agreed, but that isn't going to stop me from really enjoying this moive for the spectacle it offers." },
    { "movie-id": 4, "review": "One of my favorite space movies of all time. Makes me both incredibly proud as a member of the human race and incredibly frustrated we haven't done anything in space remotely close to what we did in the 60's & 70's since. NASA is awesome, and this film really feels great to watch. Not to mention it has an excellent musical score." },
    { "movie-id": 5, "review": "Basically a one-man show with Sam Rockwell, this is a fantastic movie and directorial debut by Duncan Jones. You'll enjoy it most if you go in not knowing anything. One of the things I love most about this film is how it plays with your understanding of \"the twist\": this movie is smart." },
    { "movie-id": 6, "review": "Duncan Jones' second film, equally smart science fiction as Moon. A really fun action-y mental trip through a seemingly normal sequence of events that gets progressively weirder as you dive deeper into the rabbit hole. Great film, great acting, great directing." },
    { "movie-id": 7, "review": "The sci-fi film that started it all, I can hardly make this list without including this classic. I recently saw this at the San Francisco Symphony Hall, orchestrated by the symphony and choir, and it was incredible." },
    { "movie-id": 8, "review": "Another classic science fiction film, Blade Runner is a must-see. It's thought-provoking and engaging, leaving you questioning whether or not Deckard is a hero or an anti-hero. Take your time with this movie and let it soak in." },
    { "movie-id": 9, "review": "This is one of the best classical science fiction films ever. There's a live-action remake coming out soon that also looks pretty good, but it won't beat the original. The film is as much art as it is entertainment. There's an excellent NerdWriter analysis of this on YouTube that I highly recommend watching." },
    { "movie-id": 10, "review": "I've also watched the classic version of this too, but for some reason I prefer the remake, personally. It's hauntingly beautiful and the soundtrack is ASMR-inducing. It's a very slow movie (the original is even slower), so be warned." }
  ],
  "movies": [
    { "id": 1, "title": "Arrival", "year": 2016, "score": 0.94, "director": "Denis Villeneuve", "url": "https://www.rottentomatoes.com/m/arrival_2016", "synopsis": "When mysterious spacecraft touch down across the globe, an elite team--lead by expert linguist Louise Banks (Amy Adams)--are brought together to investigate. As mankind teeters on the verge of global war, Banks and the team race against time for answers--and to find them, she will take a chance that could threaten her life, and quite possibly humanity.", "rating": "pg-13", "runtime-in-minutes": 116, "oscar-nominations": 8, "oscars": 1, "cover-url": "images/arrival-2016.jpg" },
    { "id": 2, "title": "Coherence", "year": 2013, "score": 0.88, "director": "James Ward Byrkit", "url": "https://www.rottentomatoes.com/m/coherence_2013", "synopsis": "On the night of an astronomical anomaly, eight friends at a dinner party experience a troubling chain of reality bending events. Part cerebral sci-fi and part relationship drama, COHERENCE is a tightly focused, intimately shot film whose tension intensely ratchets up as its numerous complex mysteries unfold.", "rating": "nr", "runtime-in-minutes": 89, "oscar-nominations": 0, "oscars": 0, "cover-url": "images/coherence-2013.jpg" },
    { "id": 3, "title": "Interstellar", "year": 2014, "score": 0.71, "director": "Christopher Nolan", "url": "https://www.rottentomatoes.com/m/interstellar_2014", "synopsis": "With our time on Earth coming to an end, a team of explorers undertakes the most important mission in human history; traveling beyond this galaxy to discover whether mankind has a future among the stars.", "rating": "pg-13", "runtime-in-minutes": 169, "oscar-nominations": 5, "oscars": 1, "cover-url": "images/interstellar-2014.jpg" },
    { "id": 4, "title": "Apollo 13", "year": 1995, "score": 0.95, "director": "Ron Howard", "url": "https://www.rottentomatoes.com/m/apollo_13", "synopsis": "\"Houston, we have a problem.\" Those words were immortalized during the tense days of the Apollo 13 lunar mission crisis in 1970, events recreated in this epic historical drama from Ron Howard. Astronaut Jim Lovell (Tom Hanks) leads command module pilot Jack Swigert (Kevin Bacon) and lunar module driver Fred Haise (Bill Paxton) on what is slated as NASA's third lunar landing mission. All goes smoothly until the craft is halfway through its mission, when an exploding oxygen tank threatens the crew's oxygen and power supplies. As the courageous astronauts face the dilemma of either suffocating or freezing to death, Mattingly and Mission Control leader Gene Kranz (Ed Harris) struggle to find a way to bring the crew back home, all the while knowing that the spacemen face probable death once the battered ship reenters the Earth's atmosphere.", "rating": "pg", "runtime-in-minutes": 140, "oscar-nominations": 9, "oscars": 2, "cover-url": "images/apollo-13-1995.jpg" },
    { "id": 5, "title": "Moon", "year": 2009, "score": 0.89, "director": "Duncan Jones", "url": "https://www.rottentomatoes.com/m/10009075_moon", "synopsis": "An astronaut miner extracting the precious moon gas that promises to reverse the Earth's energy crisis nears the end of his three-year contract, and makes an ominous discovery in this psychological sci-fi film starring Sam Rockwell and Kevin Spacey. For three long years, Sam Bell has dutifully harvested Helium 3 for Lunar, a company that claims it holds the key to solving humankind's energy crisis. As Sam's contract comes to an end, the lonely astronaut looks forward to returning to his wife and daughter down on Earth, where he will retire early and attempt to make up for lost time. His work on the Selene moon base has been enlightening -- the solitude helping him to reflect on the past and overcome some serious anger issues -- but the isolation is starting to make Sam uneasy. With only two weeks to go before he begins his journey back to Earth, Sam starts feeling strange: he's having inexplicable visions, and hearing impossible sounds. Then, when a routine extraction goes horribly awry, it becomes apparent that Lunar hasn't been entirely straightforward with Sam about their plans for replacing him. The new recruit seems strangely familiar, and before Sam returns to Earth, he will grapple with the realization that the life he has created may not be entirely his own. Up there, hundreds of thousands of miles from home, it appears that Sam's contract isn't the only thing about to expire.", "rating": "r", "runtime-in-minutes": 97, "oscar-nominations": 0, "oscars": 0, "cover-url": "images/moon-2009.jpg" },
    { "id": 6, "title": "Source Code", "year": 2011, "score": 0.92, "director": "Duncan Jones", "url": "https://www.rottentomatoes.com/m/source_code", "synopsis": "When decorated soldier Captain Colter Stevens (Jake Gyllenhaal) wakes up in the body of an unknown man, he discovers he's part of a mission to find the bomber of a Chicago commuter train. In an assignment unlike any he's ever known, he learns he's part of a government experiment called the Source Code, a program that enables him to cross over into another man's identity in the last 8 minutes of his life. With a second, much larger target threatening to kill millions in downtown Chicago, Colter re-lives the incident over and over again, gathering clues each time, until he can solve the mystery of who is behind the bombs and prevent the next attack.", "rating": "pg-13", "runtime-in-minutes": 93, "oscar-nominations": 0, "oscars": 0, "cover-url": "images/source-code-2011.jpg" },
    { "id": 7, "title": "2001: A Space Odyssey", "year": 1968, "score": 0.94, "director": "Stanley Kubrick", "url": "https://www.rottentomatoes.com/m/1000085_2001_a_space_odyssey", "synopsis": "A mind-bending sci-fi symphony, Stanley Kubrick's landmark 1968 epic pushed the limits of narrative and special effects toward a meditation on technology and humanity. Based on Arthur C. Clarke's story The Sentinel, Kubrick and Clarke's screenplay is structured in four movements. At the \"Dawn of Man,\" a group of hominids encounters a mysterious black monolith alien to their surroundings. To the strains of Strauss's 1896 Also sprach Zarathustra, a hominid invents the first weapon, using a bone to kill prey. As the hominid tosses the bone in the air, Kubrick cuts to a 21st century spacecraft hovering over the Earth, skipping ahead millions of years in technological development. U.S. scientist Dr. Heywood Floyd (William Sylvester) travels to the moon to check out the discovery of a strange object on the moon's surface: a black monolith. As the sun's rays strike the stone, however, it emits a piercing, deafening sound that fills the investigators' headphones and stops them in their path. Cutting ahead 18 months, impassive astronauts David Bowman (Keir Dullea) and Frank Poole (Gary Lockwood) head toward Jupiter on the spaceship Discovery, their only company three hibernating astronauts and the vocal, man-made HAL 9000 computer running the entire ship. When the all-too-human HAL malfunctions, however, he tries to murder the astronauts to cover his error, forcing Bowman to defend himself the only way he can. Free of HAL, and finally informed of the voyage's purpose by a recording from Floyd, Bowman journeys to \"Jupiter and Beyond the Infinite,\" through the psychedelic slit-scan star-gate to an 18th century room, and the completion of the monolith's evolutionary mission. With assistance from special-effects expert Douglas Trumbull, Kubrick spent over two years meticulously creating the most \"realistic\" depictions of outer space ever seen, greatly advancing cinematic technology for a story expressing grave doubts about technology itself. Despite some initial critical reservations that it was too long and too dull, 2001 became one of the most popular films of 1968, underlining the generation gap between young moviegoers who wanted to see something new and challenging and oldsters who \"didn't get it.\" Provocatively billed as \"the ultimate trip,\" 2001 quickly caught on with a counterculture youth audience open to a contemplative (i.e. chemically enhanced) viewing experience of a film suggesting that the way to enlightenment was to free one's mind of the U.S. military-industrial-technological complex.", "rating": "g", "runtime-in-minutes": 139, "oscar-nominations": 4, "oscars": 1, "cover-url": "images/2001-a-space-odyssey-1968.jpg" },
    { "id": 8, "title": "Blade Runner", "year": 1982, "score": 0.89, "director": "Ridley Scott", "url": "https://www.rottentomatoes.com/m/blade_runner", "synopsis": "A blend of science fiction and noir detective fiction, Blade Runner (1982) was a box office and critical bust upon its initial exhibition, but its unique postmodern production design became hugely influential within the sci-fi genre, and the film gained a significant cult following that increased its stature. Harrison Ford stars as Rick Deckard, a retired cop in Los Angeles circa 2019. L.A. has become a pan-cultural dystopia of corporate advertising, pollution and flying automobiles, as well as replicants, human-like androids with short life spans built by the Tyrell Corporation for use in dangerous off-world colonization. Deckard's former job in the police department was as a talented blade runner, a euphemism for detectives that hunt down and assassinate rogue replicants. Called before his one-time superior (M. Emmett Walsh), Deckard is forced back into active duty. A quartet of replicants led by Roy Batty (Rutger Hauer) has escaped and headed to Earth, killing several humans in the process. After meeting with the eccentric Eldon Tyrell (Joe Turkel), creator of the replicants, Deckard finds and eliminates Zhora (Joanna Cassidy), one of his targets. Attacked by another replicant, Leon (Brion James), Deckard is about to be killed when he's saved by Rachael (Sean Young), Tyrell's assistant and a replicant who's unaware of her true nature. In the meantime, Batty and his replicant pleasure model lover, Pris (Darryl Hannah) use a dying inventor, J.F. Sebastian (William Sanderson) to get close to Tyrell and murder him. Deckard tracks the pair to Sebastian's, where a bloody and violent final confrontation between Deckard and Batty takes place on a skyscraper rooftop high above the city. In 1992, Ridley Scott released a popular director's cut that removed Deckard's narration, added a dream sequence, and excised a happy ending imposed by the results of test screenings; these legendary behind-the-scenes battles were chronicled in a 1996 tome, Future Noir: The Making of Blade Runner by Paul M. Sammon.", "rating": "r", "runtime-in-minutes": 114, "oscar-nominations": 2, "oscars": 0, "cover-url": "images/blade-runner-1982.jpg" },
    { "id": 9, "title": "Ghost in the Shell", "year": 1996, "score": 0.96, "director": "Mamoru Oshii", "url": "https://www.rottentomatoes.com/m/ghost_in_the_shell", "synopsis": "In the year 2029, the world has become interconnected by a vast electronic network that permeates every aspect of life. That same network also becomes a battlefield for Tokyo's Section Nine security force, which has been charged with apprehending the master hacker known only as the Puppet Master. Spearheading the investigation is Major Motoko Kusanagi, who -- like many in her department -- is a cyborg officer, far more powerful than her human appearance would suggest. And yet as the Puppet Master, who is even capable of hacking human minds, leaves a trail of victims robbed of their memories, Kusanagi ponders the very nature of her existence: is she purely an artificial construct, or is there more? What, exactly, is the \"ghost\" -- her essence -- in her cybernetic \"shell\"? When Section Six gets involved in the case, she is forced to confront the fact that there is more here than meets the eye, and that the Puppet Master may hold some of the answers she seeks. But little does she know that he has been seeking her as well.", "rating": "r", "runtime-in-minutes": 82, "oscar-nominations": 0, "oscars": 0, "cover-url": "images/ghost-in-the-shell-1996.jpg" },
    { "id": 10, "title": "Solaris", "year": 2002, "score": 0.66, "director": "Steven Soderbergh", "url": "https://www.rottentomatoes.com/m/solaris", "synopsis": "A therapist travels to a distant space station to treat a group of astronauts traumatized by mysterious entities -- and ends up having to deal with an entity of his own -- in this second film version of Stanislaw Lem's philosophical sci-fi novel. Solaris stars George Clooney as Chris Kelvin, a psychologist still mourning the loss of his wife Rheya (Natascha McElhone) when he's implored by a colleague named Gibarian (Ulrich Tukur) to investigate the increasingly weird goings-on at the Prometheus space station. By the time Kelvin gets there, Gibarian has committed suicide, leaving only the cryptic, babbling Snow (Jeremy Davies) and the paranoid, guarded Gordon (Viola Davis), both of whom are holed up in their respective rooms. As Kelvin interrogates the skeleton crew, he learns that they've had unwanted \"visitors,\" apparitions of long-dead friends, family, and loved ones who are apparently being generated by the interstellar energy source Solaris. The doctor is dubious of their claims until one night he, too, is greeted by his wife Rheya (Natascha McElhone), whose death still torments him. At first skeptical of the new Rheya, Kelvin gradually becomes obsessed with her -- and with the guilt that he feels over their troubled marriage -- to the point where the others begin to fear for his sanity. Produced by James Cameron, Solaris represented director Steven Soderbergh's first screenplay credit since the independently financed Schizopolis in 1996.", "rating": "pg-13", "runtime-in-minutes": 120, "oscar-nominations": 0, "oscars": 0, "cover-url": "images/solaris-2002.jpg" }
  ]
}
